
// 月份数据
export const monthsData = {
  '09': 0,
  '10': 1,
  '11': 2,
  '12': 3,
  '01': 4,
}
// 每个月有多少天
export const monthsDays = [30, 31, 30, 31, 6]


// 交易类别
export const types = [
  '持卡人消费',
  '持卡人换卡',
  '补助流水',
  // '支付宝转账',
]


// 消费类别
export const mainClass = [
  '食堂',
  '购物',
  '浴室',
  '打水',
  '其他',
]


// 消费类别具体条目
export const recordClass = {

  // 食堂

  // 食堂 - 合区 - 南区
  '德园': 0,
  '俭园': 0,
  '慈园': 0,
  '馨园东': 0,
  '馨园西': 0,
  '博园': 0,
  '南区清真食堂': 0,
  '新建一楼食堂': 0,
  '新建二楼食堂': 0,

  // 食堂 - 合区 - 新区
  '新区一食堂': 0,
  '新区二食堂': 0,
  '新区三食堂': 0,
  '新区四食堂': 0,
  '新区五食堂': 0,
  '新区教工食堂': 0,
  '新区清真食堂1': 0,
  '新区清真食堂2': 0,
  '一楼西餐': 0,
  '一楼主食类': 0,
  '一楼炒菜': 0,
  '一楼备用': 0,
  '一楼米饭类': 0,
  '一楼特色风味': 0,
  '一楼点心': 0,
  '一楼烧菜类': 0,

  // 食堂 - 宣区
  '上海学校餐饮': 0,
  '福州尚食坊餐饮': 0,
  '大佳一餐饮': 0,
  '金味祥源餐饮': 0,
  '合肥黄山大厦餐饮': 0,
  '阿卜都拉餐饮': 0,
  '老鹅汤餐饮': 0,


  // 购物

  // 购物 - 合区 - 南区
  '合肥工大锦程后勤服务有限公司莘莘店': 1,
  '合肥工大锦程后勤服务有限公司礼品店': 1,
  '合肥工大锦程后勤服务有限公司本部店': 1,

  // 购物 - 合区 - 新区
  '新区南苑超市': 1,
  '合肥工大锦程后勤服务有限公司新区店': 1,
  '合肥工大锦程后勤服务有限公司新区店2店': 1,

  // 购物 - 宣区
  '兴学园超市': 1,
  '安徽满天星连锁超市有限公司': 1,
  '天津宇宁超市': 1,


  // 浴室

  // 浴室 - 南区
  '屯溪路浴室': 2,

  // 浴室 - 新区
  '浴池': 2,

  // 浴室 - 宣区
  '淋浴商户': 2,


  // 打水

  // 打水 - 南区
  '本科生公寓开水炉': 3,
  '研究生公寓开水炉': 3,

  // 打水 - 新区
  '翡翠湖公寓开水炉': 3,


  // 其他

  '新区网络圈存自助缴网费': 4,
  '注册中心成绩自助打印': 4,
  '屯溪路校区空调用电': 4,
  '学生书吧': 4,
  '宣城图书馆超期收费': 4,
  '图书馆自助打印收费': 4,
  '合工大医院': 4,
  '借还书1': 4,

}


// 别名
export const alias = {
  '一楼西餐': '新区一食堂',
  '一楼主食类': '新区一食堂',
  '一楼炒菜': '新区一食堂',
  '一楼备用': '新区一食堂',
  '一楼米饭类': '新区一食堂',
  '一楼特色风味': '新区一食堂',
  '一楼点心': '新区一食堂',
  '一楼烧菜类': '新区一食堂',
}

