
export const homeHelpInfo = [
  {
    info: '1. 怎么看下学期的课表？',
    comment: '课表页-右上角加号-其他学期',
  },
  {
    info: '2. 更换课程配色主题、解绑情侣等选项在哪里？',
    comment: '课表页-右上角加号-课表设置',
  },
  {
    info: '3. 课表显示不出来/更新失败怎么办？',
    comment: '请尝试以下操作：①退出小程序后台并重新进入；②退出登录并重新绑定，并确认自己的校区选择正确。如果进行了上述操作依旧无法正常显示，请反馈或联系客服',
  },
  {
    info: '4. 我的课表好像不准？',
    comment: '本小程序的数据与PC端教务实时同步（封网时也是），请先登录PC端教务查看自己课程是否一致，如有不一致请请反馈或联系客服',
  },

]

export const scoreHelpInfo = [
  {
    info: '1. 排名/成绩准确吗？',
    comment: '数据仅供参考，我们不代表学校官方。但我们会不断更新，尽量做到准确。',
  },
  {
    info: '2. 排名带公选吗？',
    comment: '可以在右边的设置中自行设置。',
  },
  {
    info: '3. 专业人数为什么不对？',
    comment: '只有使用过本小程序且至少完成过一次评教的同学才会被计入。',
  },
  {
    info: '4. 19级之前的英语课有没有乘1.1？',
    comment: '有，算法与学校官方相同。',
  },
  {
    info: '5. 转专业的同学的成绩是如何计算的？',
    comment: '暂时不支持准确的计算转专业同学的成绩。',
  },
  {
    info: '如以上解决不了你的问题，可以联系客服或加入反馈群反馈，',
    // comment: '暂时不支持准确的计算转专业同学的成绩。',
  },
]
